docs(#20): remove backlog and adjust diagrams
